tap 'homebrew/bundle'

# multi-version manager https://asdf-vm.com/
brew 'asdf'
brew 'ag'
# cat alternative https://github.com/sharkdp/bat
brew 'bat'
brew 'diff-so-fancy'
brew 'chamber'
brew 'coreutils'
brew 'clojure'
# https://cuelang.org/
brew 'cue-lang/tap/cue'
brew "doitlive"
# better lsh
brew 'exa'
brew 'fasd'
brew 'findutils'
# https://github.com/wagoodman/dive
brew 'dive'
brew 'gh'
brew 'gnu-sed'
brew 'go'
brew 'gnupg'
brew 'hadolint'
brew 'httpstat'
brew "httpie"
brew 'hub'
brew 'imagemagick'
brew 'python'
brew 'jq'
brew 'jp2a'
brew 'libgit2'
brew 'node'
# Security network tool
brew 'nmap'
brew "pgcli"
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'readline'
# better grep (https://github.com/BurntSushi/ripgrep)
brew 'ripgrep'
brew 'roundup'
brew 'stunnel'
brew 'shellcheck'
brew 'tree'
brew 'unzip'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'zopfli'
