tap 'homebrew/bundle'
tap 'heroku/brew'
tap 'candid82/brew' # joker

brew 'ag'
brew 'bat' # cat alternative https://github.com/sharkdp/bat
brew 'diff-so-fancy'
brew 'joker'
brew 'chamber'
brew 'coreutils'
brew 'clojure'
brew "doitlive"
brew 'exa'
brew 'fasd'
brew 'findutils'
brew 'gnu-sed'
# disabled as it causes autocomplete to not work with make
# brew 'grc'
brew 'go'
brew 'gnupg'
brew 'hadolint'
brew 'httpstat'
brew "httpie"
brew 'hub'
brew 'imagemagick'
brew 'python'
brew 'jq'
brew 'jp2a'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'libgit2'
brew 'moreutils'
brew 'node'
brew 'nmap' # Security network tool
brew "pgcli"
brew 'pipenv'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'readline'
# better grep (https://github.com/BurntSushi/ripgrep)
brew 'ripgrep'
brew 'roundup'
brew 'stunnel'
brew 'shellcheck'
brew 'tfenv'
brew 'tree'
brew 'unzip'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'zopfli'
